Revit 2027 API
ElementIsCurveDrivenFilter Constructor
Overload List
Name | Description
ElementIsCurveDrivenFilter() |  Constructs a new instance of a filter to match only curve driven elements.
ElementIsCurveDrivenFilter(Boolean) |  Constructs a new instance of a filter to match only curve driven elements, with the option to match all elements which are not curve driven elements.
Top
See Also
Reference
ElementIsCurveDrivenFilter Class
Autodesk.Revit.DB Namespace